airFoil3/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     |                                                 |
|   \\  /    A nd           | Copyright (C) 2018 Ehsan Madadi-Kandjani        |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format    ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //











// Returns a zero array


// Returns a zero array with commas in the middle of it


// Returns a linear  array with commas (initial point, last point, number of segments, c)

  
// Returns a y_t with commas (arrayX, number of segments, t, c)


// Returns a y_c with commas (arrayX, number of segments, m, p, c)


// Returns a theta with commas (arrayX, number of segments, m, p, c)

      
// Returns a xu with commas (arrayX, arrayYt, arrayTheta, number of segments)


// Returns a yu with commas (arrayYc, arrayYt, arrayTheta, number of segments)

      
// Returns a xl with commas (arrayX, arrayYt, arrayTheta, number of segments)


// Returns a yl with commas (arrayYc, arrayYt, arrayTheta, number of segments)

      
// Include angle of attack (arrayXu, arrayYu, alpha, number of segments)

      

      
// Include angle of attack (arrayXl, arrayYl, alpha, number of segments)

      

      
// Xu with comma to obtain Cmax (arrayXu, arrayYu, alpha, number of segments)



      
// Include angle of attack (arrayXl, arrayYl, alpha, number of segments)

      

      
// Returns the index of maximum array (Yc, Yt, p, number of segments)

      

      


      
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

//NACA airfoil geometry

//Chord length


//Angle of attack (in radian)


//NACA digits





//Mesh

//Height of mesh in y direction


//Length of downstream


//Foil depth in z direction perpendicular to x-y surface


//Scale factor (the mesh is normalized to have chord length equal to one)


//Number of cells and points at each direction and element

//Number of cells in y direction


//Number of cells in downstream


//Number of cells in z direction


//Number of meshes on the front part of airfoil edges p8-p9 and p8-p10b


//Number of meshes on the back part of airfoil edges p9-p11 and p10-p11


//Number of interpolation points along the airfoil for defining the splines


//Cell expansion ratios

//Expansion ratio in y direction


//Expansion ratio in downstream side


//Expansion ratio in inlet


// Base z


// Depth of airfoil


// Front z


// m,p, and t values for the airfoil




// Calculate x array


// Calculate yt array


// Calculate camber


// Calculate theta


// Calculate upper surface x components


// Calculate upper surface y components


// Calculate lower surface x components


// Calculate lower surface y components







// define Cmax


// Move the airfoil





























//Define the points for the inlet arc allocation


















// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

vertices
(
    (-3.69317256284656 0 0) // Vertex p00b = 0 
    (0.306827437153436 -4 0) // Vertex p01b = 1 
    (1 -4 0) // Vertex p02b = 2 
    (5 -4 0) // Vertex p03b = 3 
    (5 -0.00125999999999998 0) // Vertex p04b = 4 
    (5 4.0 0) // Vertex p05b = 5 
    (1 4.0 0) // Vertex p06b = 6 
    (0.306827437153436 4.0 0) // Vertex p07b = 7 
    (0 0 0) // Vertex p08b = 8 
    (0.306827437153436 0.0600063099091861 0) // Vertex p09b = 9 
    (0.306827437153436 -0.0600063099091861 0) // Vertex p10b = 10 
    (1 -0.00125999999999998 0) // Vertex p11b = 11 
    
    (-3.69317256284656 0 0.01) // Vertex p00t = 12 
    (0.306827437153436 -4 0.01) // Vertex p01t = 13 
    (1 -4 0.01) // Vertex p02t = 14 
    (5 -4 0.01) // Vertex p03t = 15 
    (5 -0.00125999999999998 0.01) // Vertex p04t = 16 
    (5 4.0 0.01) // Vertex p05t = 17 
    (1 4.0 0.01) // Vertex p06t = 18 
    (0.306827437153436 4.0 0.01) // Vertex p07t = 19 
    (0 0 0.01) // Vertex p08t = 20 
    (0.306827437153436 0.0600063099091861 0.01) // Vertex p09t = 21 
    (0.306827437153436 -0.0600063099091861 0.01) // Vertex p10t = 22 
    (1 -0.00125999999999998 0.01) // Vertex p11t = 23 
);

blocks
(
    //B0
    hex (0 1 10 8 12 13 22 20)
    square
    (12 250 1)
    simpleGrading (1 1 1)
    
    //B1
    hex (1 2 11 10 13 14 23 22)
    square
    (12 250 1)
    simpleGrading (1 1 1)
    
    //B2
    hex (2 3 4 11 14 15 16 23)
    square
    (3 250 1)
    simpleGrading (1 1 1)
    
    //B3
    hex (11 4 5 6 23 16 17 18)
    square
    (3 250 1)
    simpleGrading (1 1 1)
    
    //B4
    hex (9 11 6 7 21 23 18 19)
    square
    (12 250 1)
    simpleGrading (1 1 1)
    
    //B5
    hex (8 9 7 0 20 21 19 12)
    square
    (12 250 1)
    simpleGrading (1 1 1)
);

edges
(
    //Inlet arc
    arc 0 7 (-2.52159968759276 2.82842712474619 0)
    arc 0 1 (-2.52159968759276 -2.82842712474619 0)

    arc 12 19 (-2.52159968759276 2.82842712474619 0.01)
    arc 12 13 (-2.52159968759276 -2.82842712474619 0.01)
    
    //Airfoil surface spline
    spline 8 10 
             (( 0.000251728808407459 -0.00280731873435275 0 ) ( 0.00100666176405778 -0.00557569683783854 0 ) ( 0.00226403871345771 -0.00830400178230542 0 ) ( 0.00402259358460233 -0.0109908264614087 0 ) ( 0.00628055566180286 -0.0136344980737385 0 ) ( 0.00903565136864665 -0.0162330903349045 0 ) ( 0.0122851065572965 -0.0187844388685296 0 ) ( 0.0160256493018219 -0.0212861595868385 0 ) ( 0.0202535131927513 -0.0237356698349058 0 ) ( 0.0249644411295273 -0.0261302120391248 0 ) ( 0.0301536896070458 -0.0284668795705562 0 ) ( 0.0358160334919637 -0.0307426445078949 0 ) ( 0.0419457712839652 -0.0329543869632183 0 ) ( 0.0485367308566894 -0.0350989256167161 0 ) ( 0.0555822756725383 -0.0371730490944749 0 ) ( 0.0630753114651075 -0.0391735478162298 0 ) ( 0.0710082933825115 -0.0410972459378822 0 ) ( 0.0793732335844094 -0.0429410330165016 0 ) ( 0.0881617092850836 -0.044701895033407 0 ) ( 0.0973648712344707 -0.0463769444236124 0 ) ( 0.106973452628606 -0.0479634487771926 0 ) ( 0.116977778440511 -0.0494588578997109 0 ) ( 0.127367775162123 -0.0508608289443815 0 ) ( 0.138132980947465 -0.0521672493577403 0 ) ( 0.149262556146839 -0.0533762574127946 0 ) ( 0.160745294221434 -0.0544862601384377 0 ) ( 0.172569633027358 -0.0554959484908123 0 ) ( 0.184723666457739 -0.0564043096507431 0 ) ( 0.197195156431167 -0.0572106363707474 0 ) ( 0.209971545214401 -0.057914533334908 0 ) ( 0.223039968066945 -0.0585159205344701 0 ) ( 0.236387266194749 -0.0590150337008218 0 ) ( 0.25 -0.059412421875 0 ) ( 0.263864462613659 -0.0597089422284833 0 ) ( 0.277966693697113 -0.0599057522833081 0 ) ( 0.292292493499057 -0.0600042997100145 0 ))
         
      
    spline 10 11 
...
         
      
    spline 8 9 
             (( 0.000251728808407459 0.00280731873435275 0 ) ( 0.00100666176405778 0.00557569683783854 0 ) ( 0.00226403871345771 0.00830400178230542 0 ) ( 0.00402259358460233 0.0109908264614087 0 ) ( 0.00628055566180286 0.0136344980737385 0 ) ( 0.00903565136864665 0.0162330903349045 0 ) ( 0.0122851065572965 0.0187844388685296 0 ) ( 0.0160256493018219 0.0212861595868385 0 ) ( 0.0202535131927513 0.0237356698349058 0 ) ( 0.0249644411295273 0.0261302120391248 0 ) ( 0.0301536896070458 0.0284668795705562 0 ) ( 0.0358160334919637 0.0307426445078949 0 ) ( 0.0419457712839652 0.0329543869632183 0 ) ( 0.0485367308566894 0.0350989256167161 0 ) ( 0.0555822756725383 0.0371730490944749 0 ) ( 0.0630753114651075 0.0391735478162298 0 ) ( 0.0710082933825115 0.0410972459378822 0 ) ( 0.0793732335844094 0.0429410330165016 0 ) ( 0.0881617092850836 0.044701895033407 0 ) ( 0.0973648712344707 0.0463769444236124 0 ) ( 0.106973452628606 0.0479634487771926 0 ) ( 0.116977778440511 0.0494588578997109 0 ) ( 0.127367775162123 0.0508608289443815 0 ) ( 0.138132980947465 0.0521672493577403 0 ) ( 0.149262556146839 0.0533762574127946 0 ) ( 0.160745294221434 0.0544862601384377 0 ) ( 0.172569633027358 0.0554959484908123 0 ) ( 0.184723666457739 0.0564043096507431 0 ) ( 0.197195156431167 0.0572106363707474 0 ) ( 0.209971545214401 0.057914533334908 0 ) ( 0.223039968066945 0.0585159205344701 0 ) ( 0.236387266194749 0.0590150337008218 0 ) ( 0.25 0.059412421875 0 ) ( 0.263864462613659 0.0597089422284833 0 ) ( 0.277966693697113 0.0599057522833081 0 ) ( 0.292292493499057 0.0600042997100145 0 ))
         
      
    spline 9 11 
...
         
      
    
    spline 20 22 
             (( 0.000251728808407459 -0.00280731873435275 0.01 ) ( 0.00100666176405778 -0.00557569683783854 0.01 ) ( 0.00226403871345771 -0.00830400178230542 0.01 ) ( 0.00402259358460233 -0.0109908264614087 0.01 ) ( 0.00628055566180286 -0.0136344980737385 0.01 ) ( 0.00903565136864665 -0.0162330903349045 0.01 ) ( 0.0122851065572965 -0.0187844388685296 0.01 ) ( 0.0160256493018219 -0.0212861595868385 0.01 ) ( 0.0202535131927513 -0.0237356698349058 0.01 ) ( 0.0249644411295273 -0.0261302120391248 0.01 ) ( 0.0301536896070458 -0.0284668795705562 0.01 ) ( 0.0358160334919637 -0.0307426445078949 0.01 ) ( 0.0419457712839652 -0.0329543869632183 0.01 ) ( 0.0485367308566894 -0.0350989256167161 0.01 ) ( 0.0555822756725383 -0.0371730490944749 0.01 ) ( 0.0630753114651075 -0.0391735478162298 0.01 ) ( 0.0710082933825115 -0.0410972459378822 0.01 ) ( 0.0793732335844094 -0.0429410330165016 0.01 ) ( 0.0881617092850836 -0.044701895033407 0.01 ) ( 0.0973648712344707 -0.0463769444236124 0.01 ) ( 0.106973452628606 -0.0479634487771926 0.01 ) ( 0.116977778440511 -0.0494588578997109 0.01 ) ( 0.127367775162123 -0.0508608289443815 0.01 ) ( 0.138132980947465 -0.0521672493577403 0.01 ) ( 0.149262556146839 -0.0533762574127946 0.01 ) ( 0.160745294221434 -0.0544862601384377 0.01 ) ( 0.172569633027358 -0.0554959484908123 0.01 ) ( 0.184723666457739 -0.0564043096507431 0.01 ) ( 0.197195156431167 -0.0572106363707474 0.01 ) ( 0.209971545214401 -0.057914533334908 0.01 ) ( 0.223039968066945 -0.0585159205344701 0.01 ) ( 0.236387266194749 -0.0590150337008218 0.01 ) ( 0.25 -0.059412421875 0.01 ) ( 0.263864462613659 -0.0597089422284833 0.01 ) ( 0.277966693697113 -0.0599057522833081 0.01 ) ( 0.292292493499057 -0.0600042997100145 0.01 ))
         
      
    spline 22 23 
...
         
      
    spline 20 21 
             (( 0.000251728808407459 0.00280731873435275 0.01 ) ( 0.00100666176405778 0.00557569683783854 0.01 ) ( 0.00226403871345771 0.00830400178230542 0.01 ) ( 0.00402259358460233 0.0109908264614087 0.01 ) ( 0.00628055566180286 0.0136344980737385 0.01 ) ( 0.00903565136864665 0.0162330903349045 0.01 ) ( 0.0122851065572965 0.0187844388685296 0.01 ) ( 0.0160256493018219 0.0212861595868385 0.01 ) ( 0.0202535131927513 0.0237356698349058 0.01 ) ( 0.0249644411295273 0.0261302120391248 0.01 ) ( 0.0301536896070458 0.0284668795705562 0.01 ) ( 0.0358160334919637 0.0307426445078949 0.01 ) ( 0.0419457712839652 0.0329543869632183 0.01 ) ( 0.0485367308566894 0.0350989256167161 0.01 ) ( 0.0555822756725383 0.0371730490944749 0.01 ) ( 0.0630753114651075 0.0391735478162298 0.01 ) ( 0.0710082933825115 0.0410972459378822 0.01 ) ( 0.0793732335844094 0.0429410330165016 0.01 ) ( 0.0881617092850836 0.044701895033407 0.01 ) ( 0.0973648712344707 0.0463769444236124 0.01 ) ( 0.106973452628606 0.0479634487771926 0.01 ) ( 0.116977778440511 0.0494588578997109 0.01 ) ( 0.127367775162123 0.0508608289443815 0.01 ) ( 0.138132980947465 0.0521672493577403 0.01 ) ( 0.149262556146839 0.0533762574127946 0.01 ) ( 0.160745294221434 0.0544862601384377 0.01 ) ( 0.172569633027358 0.0554959484908123 0.01 ) ( 0.184723666457739 0.0564043096507431 0.01 ) ( 0.197195156431167 0.0572106363707474 0.01 ) ( 0.209971545214401 0.057914533334908 0.01 ) ( 0.223039968066945 0.0585159205344701 0.01 ) ( 0.236387266194749 0.0590150337008218 0.01 ) ( 0.25 0.059412421875 0.01 ) ( 0.263864462613659 0.0597089422284833 0.01 ) ( 0.277966693697113 0.0599057522833081 0.01 ) ( 0.292292493499057 0.0600042997100145 0.01 ))
         
      
    spline 21 23 
...
         
      
    
);

patches
(
    wall airfoil
    (
        (8 10 22 20)
        (10 11 23 22)
        (8 9 21 20)
        (9 11 23 21)
    )
    
    patch farBoundaries
    (
        (6 7 19 18)
        (5 6 18 17)
        (2 3 15 14)
        (1 2 14 13)
    )
    
    patch inlet
    (
        (7 0 12 19)
        (0 1 13 12)
    )
    
    patch outlet
    (
        (4 5 17 16)
        (3 4 16 15)
    )
);

mergePatchPairs
(
);
