airFoil3/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6.0
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    airfoil
    {
        type            wall;
        inGroups        1(wall);
        nFaces          48;
        startFace       26699;
    }
    farBoundaries
    {
        type            patch;
        nFaces          30;
        startFace       26747;
    }
    inlet
    {
        type            patch;
        nFaces          24;
        startFace       26777;
    }
    outlet
    {
        type            patch;
        nFaces          500;
        startFace       26801;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          27000;
        startFace       27301;
    }
)

// ************************************************************************* //
