airFoil3/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{
    inlet
    {
        type            uniformFixedValue;
        uniformValue 	constant (1 0 0);
    }

    outlet
    {
        type            pressureInletOutletVelocity;
        inletValue 	uniform (1 0 0);
	value		uniform (1 0 0); 
    }

    walls
    {
        type            noSlip;
    }

    frontAndBack
    {
        type            empty;
    }

    airfoil
    {
        type            fixedValue;
	value		uniform (0 0 0); 
    }

    farBoundaries
    {
        type            noSlip;
    }
}

// ************************************************************************* //
